package HW_09_05_2023;

/**
 * Дан двумерный массив 'm' на 'n' и число x = 14, у массива числа как в строках так и столбцах отсортированы по возрастанию:
 * <p>
 *  1   4   7  11  15  16
 *  2   5   8  12  19  22
 *  3   6   9  16  22  24
 * 10  13  14  17  24  27
 * 18  21  23  26  30  36
 * <p>
 * Нужно найти число k в массиве, маскимально быстрым способом.
 */
public class Hw2 {
    public static void main(String[] args) {
        int[][] arr = {{1, 4, 7, 11, 15, 16}, {2, 5, 8, 12, 19, 22}, {3, 6, 9, 16, 22, 24}, {10, 13, 14, 17, 24, 27}, {18, 21, 23, 26, 30, 36}};
        int k = 26;
        int x = arr[0].length - 1;
        int y = 0;

        while (true) {
            if (arr[y][x] == k) {
                break;
            } else if (arr[y][x] > k) {
                x--;
            } else {
                y++;
            }
        }
        System.out.println(arr[y][x] + ", " + x + ", " + y);

    }
}
